app/controllers/posts_controller.rb

  def update
    post = Post.find(params[:id])
    post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["description", "test 5 k"], ["updated_at", "2022-01-26 10:43:18.543021"], ["id", 8]]

  def create
    post = Post.new(post_params)
    post.save
---
INSERT INTO "posts" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "7"], ["description", "test 7"], ["created_at", "2022-01-26 10:02:22.880319"], ["updated_at", "2022-01-26 10:02:22.880319"]]